In [51]:
people = {
    'first': ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [52]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [53]:
df['first']

0    Corey
1     Jane
2     John
Name: first, dtype: object

In [4]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

### update columns

In [5]:
df.columns = ['first_name', 'last_name', 'email']

In [6]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [7]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
df.rename(columns={'first_name':' first', 'last_name': 'last'})

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [12]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
df.rename(columns={'first_name':' first', 'last_name': 'last'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

### update values

In [14]:
df.loc[2]

 first                 John
last                    Doe
email     JohnDoe@email.com
Name: 2, dtype: object

In [15]:
df.loc[2] = ['John', 'Smith', 'jhonsmith@gmail.com']

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      jhonsmith@gmail.com

In [17]:
df.loc[2,['last', 'email']]

last                   Smith
email    jhonsmith@gmail.com
Name: 2, dtype: object

In [18]:
df.loc[2,['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [20]:
df.loc[2,['last']] = 'Smith'

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [22]:
df.at[2,['last']] = 'Doe'

In [23]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [24]:
filt = (df['email']) == 'JohnDoe@email.com'
df[filt]

   first last              email
2   John  Doe  JohnDoe@email.com

In [25]:
df[filt]['last']

2    Doe
Name: last, dtype: object

In [26]:
# df[filt]['last'] = 'Smith'

/var/folders/24/00t4pc3n19n_9bmw1s9dcj180000gn/T/ipykernel_4715/662645475.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [27]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [28]:
df.loc[filt, 'last'] = 'Smith'

In [29]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [30]:
df['email'] = df['email'].str.lower()

In [31]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

### apply, map, applymap, replace

#### 1. apply

In [32]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [33]:
def update_email(email):
    return email.upper()

In [34]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [35]:
df['email'] = df['email'].apply(update_email)

In [36]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [37]:
# lambda function

df['email'] = df['email'].apply(lambda x: x.lower())

In [38]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [39]:
df.apply(len)

 first    3
last      3
email     3
dtype: int64

In [40]:
len(df['email'])

3

In [41]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [42]:
df.apply(pd.Series.min)

 first                      Corey
last                          Doe
email     coreymschafer@gmail.com
dtype: object

In [43]:
# use lambda to replace pd.Series
df.apply(lambda x: x.min())

 first                      Corey
last                          Doe
email     coreymschafer@gmail.com
dtype: object

#### applymap: only works on DataFrame
to apply a func to every element in the dataFrame

In [44]:
df.applymap(len)

    first  last  email
0       5     7     23
1       4     3     17
2       4     5     17

In [45]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

#### map: ony works on Series

In [46]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [50]:
df[' first']

0    Corey
1     Jane
2     John
Name:  first, dtype: object

In [54]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

####replace

In [55]:
df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [56]:
df['first'] =  df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [57]:
df

   first     last                    email
0  Chris  Schafer  CoreyMSchafer@gmail.com
1   Mary      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com